kicklistbot2/data-processing-with-clojure.org
#+TITLE: Data Processing with Clojure
#+AUTHOR: port19
#+Descritpion: add later
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: \n:t

* Problem Definition

A class of application that I quite enjoy writing is pulling data from some api endpoint and processing it to my benefit
About two years ago I wrote a discord bot that pulled data from the Clash Royale API and based on that data displayed clan members to be promoted / demoted / kicked based on different thresholds for some performance / engagement indicators
Clojure claims to be very good with data. Let's see that in action by rewriting that old code (minus the discord integration)

A note on setup: I use doom emacs and cider for development and emacs org mode with code blocks and html export to write this document

* Project Setup and Dependencies

There are two main things we're gonna outsource to dependencies: json processing and http requests
After a short period of searching on github I found the following two candidates

- [[https://github.com/dakrone/clj-http#installation][clj-http]]
- [[https://github.com/dakrone/cheshire#usage][cheshire]]

Here is how my project.clj looks with both installed

#+begin_src clojure
(defproject kicklistbot2 "0.1.0-SNAPSHOT"
  :description "FIXME: write description"
  :url "http://example.com/FIXME"
  :license {:name "GPL-3.0"
            :url "https://www.eclipse.org/legal/epl-2.0/"}
  :dependencies [[org.clojure/clojure "1.11.1"]
                [clj-http "3.12.3"]
                [cheshire "5.11.0"]]
  :repl-options {:init-ns kicklistbot2.core})
#+end_src

* The raw data

The test clan is called B Kindom and has the clan tag #JGLJR8L
A full clan has 50 members, in the following I'll replace the repeating pattern with ... except for the first and last item in the large list
For this to work we need to pull data from two enpoints of the clash royale api:

** /members

Relevant fields: "name" "role" "donations"

#+begin_src json
{
  "items": [
    {
      "tag": "#PQLPVJPJG",
      "name": "つば。",
      "role": "elder",
      "lastSeen": "20220917T120523.000Z",
      "expLevel": 14,
      "trophies": 6153,
      "arena": {
        "id": 54000015,
        "name": "Master I"
      },
      "clanRank": 1,
      "previousClanRank": 1,
      "donations": 585,
      "donationsReceived": 424,
      "clanChestPoints": 0
    },
      ...
    {
      "tag": "#RJCUGJU",
      "name": "~wonderland~",
      "role": "member",
      "lastSeen": "20220910T111416.000Z",
      "expLevel": 14,
      "trophies": 4214,
      "arena": {
        "id": 54000055,
        "name": "Arena 13"
      },
      "clanRank": 50,
      "previousClanRank": 50,
      "donations": 0,
      "donationsReceived": 0,
      "clanChestPoints": 0
    }
  ],
  "paging": {
    "cursors": {}
  }
}
#+end_src

