kicklistbot2/data-processing-with-clojure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-17 Sat 18:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data Processing with Clojure</title>
<meta name="author" content="port19" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Data Processing with Clojure</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0d229af">1. Problem Definition</a></li>
<li><a href="#org8a87d75">2. Project Setup and Dependencies</a></li>
<li><a href="#org3f6c67a">3. The raw data</a>
<ul>
<li><a href="#orged48597">3.1. /members</a></li>
<li><a href="#orgf991f86">3.2. /currentriverrace</a></li>
</ul>
</li>
<li><a href="#orgfd70ff7">4. Requesting and decoding the data</a>
<ul>
<li><a href="#orgb2eee00">4.1. Grabbing donations</a></li>
<li><a href="#org2da9d9b">4.2. Grabbing riverrace (aka war) stats</a></li>
</ul>
</li>
<li><a href="#orgf98c5f7">5. Merging the data</a>
<ul>
<li><a href="#orgf2630be">5.1. Getting our keys back</a></li>
<li><a href="#orgc3cb811">5.2. Merging</a></li>
<li><a href="#org1be1185">5.3. Making the data prettier</a></li>
<li><a href="#org254dbbf">5.4. Catching the edge case</a></li>
<li><a href="#org810d966">5.5. Tadaa</a></li>
</ul>
</li>
<li><a href="#org807ec65">6. Wrapping up</a></li>
<li><a href="#org4750c80">7. Full code</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0d229af" class="outline-2">
<h2 id="org0d229af"><span class="section-number-2">1.</span> Problem Definition</h2>
<div class="outline-text-2" id="text-1">
<p>
A class of application that I quite enjoy writing is pulling data from some api endpoint and processing it to my benefit<br />
About two years ago I wrote a discord bot that pulled data from the Clash Royale API and based on that data displayed clan members to be promoted / demoted / kicked based on different thresholds for some performance / engagement indicators<br />
Clojure claims to be very good with data. Let&rsquo;s see that in action by rewriting that old code (minus the discord integration)<br />
</p>

<p>
A note on setup: I use doom emacs and cider for development and emacs org mode with code blocks and html export to write this document<br />
</p>
</div>
</div>

<div id="outline-container-org8a87d75" class="outline-2">
<h2 id="org8a87d75"><span class="section-number-2">2.</span> Project Setup and Dependencies</h2>
<div class="outline-text-2" id="text-2">
<p>
There are two main things we&rsquo;re gonna outsource to dependencies: json processing and http requests<br />
After a short period of searching on github I found the following two candidates<br />
</p>

<ul class="org-ul">
<li><a href="https://github.com/dakrone/clj-http#installation">clj-http</a><br /></li>
<li><a href="https://github.com/dakrone/cheshire#usage">cheshire</a><br /></li>
</ul>

<p>
Here is how my project.clj looks with both installed<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #fe8019;">(</span><span style="color: #fb4934;">defproject</span> <span style="color: #b8bb26;">kicklistbot2</span> <span style="color: #b8bb26;">"0.1.0-SNAPSHOT"</span>
  <span style="color: #d3869b;">:description</span> <span style="color: #b8bb26;">"</span><span style="color: #fb4934; font-weight: bold;">FIXME:</span><span style="color: #b8bb26;"> write description"</span>
  <span style="color: #d3869b;">:url</span> <span style="color: #b8bb26;">"http://example.com/</span><span style="color: #fb4934; font-weight: bold;">FIXME</span><span style="color: #b8bb26;">"</span>
  <span style="color: #d3869b;">:license</span> <span style="color: #cc241d;">{</span><span style="color: #d3869b;">:name</span> <span style="color: #b8bb26;">"GPL-3.0"</span>
            <span style="color: #d3869b;">:url</span> <span style="color: #b8bb26;">"https://www.eclipse.org/legal/epl-2.0/"</span><span style="color: #cc241d;">}</span>
  <span style="color: #d3869b;">:dependencies</span> <span style="color: #cc241d;">[</span><span style="color: #b8bb26;">[</span><span style="color: #fabd2f;">org.clojure</span>/clojure <span style="color: #b8bb26;">"1.11.1"</span><span style="color: #b8bb26;">]</span>
                <span style="color: #b8bb26;">[</span>clj-http <span style="color: #b8bb26;">"3.12.3"</span><span style="color: #b8bb26;">]</span>
                <span style="color: #b8bb26;">[</span>cheshire <span style="color: #b8bb26;">"5.11.0"</span><span style="color: #b8bb26;">]</span><span style="color: #cc241d;">]</span>
  <span style="color: #d3869b;">:repl-options</span> <span style="color: #cc241d;">{</span><span style="color: #d3869b;">:init-ns</span> kicklistbot2.core<span style="color: #cc241d;">}</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f6c67a" class="outline-2">
<h2 id="org3f6c67a"><span class="section-number-2">3.</span> The raw data</h2>
<div class="outline-text-2" id="text-3">
<p>
The test clan is called B Kindom and has the clan tag #JGLJR8L<br />
A full clan has 50 members, in the following I&rsquo;ll replace the repeating pattern with &#x2026; except for the first and last item in the large list<br />
For this to work we need to pull data from two enpoints of the clash royale api:<br />
</p>
</div>

<div id="outline-container-orged48597" class="outline-3">
<h3 id="orged48597"><span class="section-number-3">3.1.</span> /members</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Relevant fields: &ldquo;name&rdquo; &ldquo;role&rdquo; &ldquo;donations&rdquo;<br />
</p>

<div class="org-src-container">
<pre class="src src-json">{
  <span style="color: #fb4934;">"items"</span>: [
    {
      <span style="color: #fb4934;">"tag"</span>: <span style="color: #b8bb26;">"#PQLPVJPJG"</span>,
      <span style="color: #fb4934;">"name"</span>: <span style="color: #b8bb26;">"&#12388;&#12400;&#12290;"</span>,
      <span style="color: #fb4934;">"role"</span>: <span style="color: #b8bb26;">"elder"</span>,
      <span style="color: #fb4934;">"lastSeen"</span>: <span style="color: #b8bb26;">"20220917T120523.000Z"</span>,
      <span style="color: #fb4934;">"expLevel"</span>: <span style="color: #d3869b; font-weight: bold;">14</span>,
      <span style="color: #fb4934;">"trophies"</span>: <span style="color: #d3869b; font-weight: bold;">6153</span>,
      <span style="color: #fb4934;">"arena"</span>: {
        <span style="color: #fb4934;">"id"</span>: <span style="color: #d3869b; font-weight: bold;">54000015</span>,
        <span style="color: #fb4934;">"name"</span>: <span style="color: #b8bb26;">"Master I"</span>
      },
      <span style="color: #fb4934;">"clanRank"</span>: <span style="color: #d3869b; font-weight: bold;">1</span>,
      <span style="color: #fb4934;">"previousClanRank"</span>: <span style="color: #d3869b; font-weight: bold;">1</span>,
      <span style="color: #fb4934;">"donations"</span>: <span style="color: #d3869b; font-weight: bold;">585</span>,
      <span style="color: #fb4934;">"donationsReceived"</span>: <span style="color: #d3869b; font-weight: bold;">424</span>,
      <span style="color: #fb4934;">"clanChestPoints"</span>: <span style="color: #d3869b; font-weight: bold;">0</span>
    },
      ...
    {
      <span style="color: #fb4934;">"tag"</span>: <span style="color: #b8bb26;">"#RJCUGJU"</span>,
      <span style="color: #fb4934;">"name"</span>: <span style="color: #b8bb26;">"~wonderland~"</span>,
      <span style="color: #fb4934;">"role"</span>: <span style="color: #b8bb26;">"member"</span>,
      <span style="color: #fb4934;">"lastSeen"</span>: <span style="color: #b8bb26;">"20220910T111416.000Z"</span>,
      <span style="color: #fb4934;">"expLevel"</span>: <span style="color: #d3869b; font-weight: bold;">14</span>,
      <span style="color: #fb4934;">"trophies"</span>: <span style="color: #d3869b; font-weight: bold;">4214</span>,
      <span style="color: #fb4934;">"arena"</span>: {
        <span style="color: #fb4934;">"id"</span>: <span style="color: #d3869b; font-weight: bold;">54000055</span>,
        <span style="color: #fb4934;">"name"</span>: <span style="color: #b8bb26;">"Arena 13"</span>
      },
      <span style="color: #fb4934;">"clanRank"</span>: <span style="color: #d3869b; font-weight: bold;">50</span>,
      <span style="color: #fb4934;">"previousClanRank"</span>: <span style="color: #d3869b; font-weight: bold;">50</span>,
      <span style="color: #fb4934;">"donations"</span>: <span style="color: #d3869b; font-weight: bold;">0</span>,
      <span style="color: #fb4934;">"donationsReceived"</span>: <span style="color: #d3869b; font-weight: bold;">0</span>,
      <span style="color: #fb4934;">"clanChestPoints"</span>: <span style="color: #d3869b; font-weight: bold;">0</span>
    }
  ],
  <span style="color: #fb4934;">"paging"</span>: {
    <span style="color: #fb4934;">"cursors"</span>: {}
  }
}
</pre>
</div>
</div>
</div>
