kicklistbot2/data-processing-with-clojure.org
** /currentriverrace

Relevant fields: "name" "decksUsed" (within "participants")

#+begin_src json
{
  "state": "full",
  "clan": {
    "tag": "#JGLJR8L",
    "name": "b kindom",
    "badgeId": 16000010,
    "fame": 1952,
    "repairPoints": 0,
    "participants": [
      {
        "tag": "#8PULQQVL",
        "name": "SakeBRSP",
        "fame": 0,
        "repairPoints": 0,
        "boatAttacks": 0,
        "decksUsed": 0,
        "decksUsedToday": 0
      },
        ...
      {
        "tag": "#98LQCGL0",
        "name": "rweavere",
        "fame": 2150,
        "repairPoints": 0,
        "boatAttacks": 2,
        "decksUsed": 13,
        "decksUsedToday": 4
      }
    ],
    "periodPoints": 5275,
    "clanScore": 2570
  },
  "clans": [
      _not interesting to us_
  ],
  "sectionIndex": 1,
  "periodIndex": 12,
  "periodType": "warDay",
  "periodLogs": [
      _also not interesting to us_
  ]
}
#+end_src

* Requesting and decoding the data

** Grabbing donations

#+begin_src clojure
(def don
    (->> (:body (client/get "https://api.clashroyale.com/v1/clans/%23JGLJR8L/members" {:headers {:Authorization (str "Bearer " (slurp "token"))}}))
         (#(decode % true))
         (:items)
         (map #(map % [:name :role :donations]))
    ))
#+end_src

Let's walk through this code snippet.
- ~(def don (...))~ binds whatever we do next to the variable don, which we will continue to use later
- ~(->> (x) (y) (z))~ is called threadlast. It acts like a pipe, providing the output of (x) as the input of (y) and so forth.
  This can be seen as a more elegant shorthand to avoid ugly )))))))s
  ~(->> (x) (y) (z)~ is equivalent to ~(z (y (x)))~
- ~(:body (client/get "https://api.clashroyale.com/v1/clans/%23JGLJR8L/members") ...)~ is executing a get request on the members api endpoint and extracting the body of that request.
  Note we're not checking for the status. Good design would dictate checking it, but that can be done way later.
- ~(... {:headers {:Authorization (str "Bearer" (slurp "token"))}}))~ Is setting up authorizaiton for the api. This is very specific per api, so check the api docs.
  Note ~(slurp "token")~. This is a useful pattern for dealing with secrets on server side code. Just put the token into a file and read it at runtime. ~slurp~ reads the file ~token~, which resides at the top level of our project directory
- ~(#(decode % true))~ applies a lambda function to the input. we need to use a lambda function because the input should not be appended to the argument list but needs to squeeze between the "decode" and "true".
  This is cheshire! And it's probably the only thing we're gonna use of it.
- ~(:items)~ as you might guess, this returns the ~(:items)~ list from the now decoded json. These are our clan members.
- ~(map #(map % [:name :role :donations]))~ This line of code took me embarassingly long to write. It makes sure to strip each members of his uninteresting properties, leaving only "name", "role" and "donations".
  This is why we have a double map. we map for each of the members.

** Grabbing riverrace (aka war) stats

#+begin_src clojure
(def war
   (->> (:body (client/get "https://api.clashroyale.com/v1/clans/%23JGLJR8L/currentriverrace" {:headers {:Authorization (str "Bearer " (slurp "token"))}}))
        (#(decode % true))
        (:clan)
        (:participants)
        (map #(map % [:name :decksUsed]))
   ))
#+end_src

Knowing what you know from the last section you should be able to figure out what this does on your own.

* Merging the data

Great! We can now conveniently check war statistics and donation statistics.
But we want more! We want to check both at the same time. Time to get them into a more useful data structure.

