kicklistbot2/data-processing-with-clojure.html

<div id="outline-container-orgf991f86" class="outline-3">
<h3 id="orgf991f86"><span class="section-number-3">3.2.</span> /currentriverrace</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Relevant fields: &ldquo;name&rdquo; &ldquo;decksUsed&rdquo; (within &ldquo;participants&rdquo;)<br />
</p>

<div class="org-src-container">
<pre class="src src-json">{
  <span style="color: #fb4934;">"state"</span>: <span style="color: #b8bb26;">"full"</span>,
  <span style="color: #fb4934;">"clan"</span>: {
    <span style="color: #fb4934;">"tag"</span>: <span style="color: #b8bb26;">"#JGLJR8L"</span>,
    <span style="color: #fb4934;">"name"</span>: <span style="color: #b8bb26;">"b kindom"</span>,
    <span style="color: #fb4934;">"badgeId"</span>: <span style="color: #d3869b; font-weight: bold;">16000010</span>,
    <span style="color: #fb4934;">"fame"</span>: <span style="color: #d3869b; font-weight: bold;">1952</span>,
    <span style="color: #fb4934;">"repairPoints"</span>: <span style="color: #d3869b; font-weight: bold;">0</span>,
    <span style="color: #fb4934;">"participants"</span>: [
      {
        <span style="color: #fb4934;">"tag"</span>: <span style="color: #b8bb26;">"#8PULQQVL"</span>,
        <span style="color: #fb4934;">"name"</span>: <span style="color: #b8bb26;">"SakeBRSP"</span>,
        <span style="color: #fb4934;">"fame"</span>: <span style="color: #d3869b; font-weight: bold;">0</span>,
        <span style="color: #fb4934;">"repairPoints"</span>: <span style="color: #d3869b; font-weight: bold;">0</span>,
        <span style="color: #fb4934;">"boatAttacks"</span>: <span style="color: #d3869b; font-weight: bold;">0</span>,
        <span style="color: #fb4934;">"decksUsed"</span>: <span style="color: #d3869b; font-weight: bold;">0</span>,
        <span style="color: #fb4934;">"decksUsedToday"</span>: <span style="color: #d3869b; font-weight: bold;">0</span>
      },
        ...
      {
        <span style="color: #fb4934;">"tag"</span>: <span style="color: #b8bb26;">"#98LQCGL0"</span>,
        <span style="color: #fb4934;">"name"</span>: <span style="color: #b8bb26;">"rweavere"</span>,
        <span style="color: #fb4934;">"fame"</span>: <span style="color: #d3869b; font-weight: bold;">2150</span>,
        <span style="color: #fb4934;">"repairPoints"</span>: <span style="color: #d3869b; font-weight: bold;">0</span>,
        <span style="color: #fb4934;">"boatAttacks"</span>: <span style="color: #d3869b; font-weight: bold;">2</span>,
        <span style="color: #fb4934;">"decksUsed"</span>: <span style="color: #d3869b; font-weight: bold;">13</span>,
        <span style="color: #fb4934;">"decksUsedToday"</span>: <span style="color: #d3869b; font-weight: bold;">4</span>
      }
    ],
    <span style="color: #fb4934;">"periodPoints"</span>: <span style="color: #d3869b; font-weight: bold;">5275</span>,
    <span style="color: #fb4934;">"clanScore"</span>: <span style="color: #d3869b; font-weight: bold;">2570</span>
  },
  <span style="color: #fb4934;">"clans"</span>: [
      _not interesting to us_
  ],
  <span style="color: #fb4934;">"sectionIndex"</span>: <span style="color: #d3869b; font-weight: bold;">1</span>,
  <span style="color: #fb4934;">"periodIndex"</span>: <span style="color: #d3869b; font-weight: bold;">12</span>,
  <span style="color: #fb4934;">"periodType"</span>: <span style="color: #b8bb26;">"warDay"</span>,
  <span style="color: #fb4934;">"periodLogs"</span>: [
      _also not interesting to us_
  ]
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfd70ff7" class="outline-2">
<h2 id="orgfd70ff7"><span class="section-number-2">4.</span> Requesting and decoding the data</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgb2eee00" class="outline-3">
<h3 id="orgb2eee00"><span class="section-number-3">4.1.</span> Grabbing donations</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">don</span>
    <span style="color: #cc241d;">(</span><span style="color: #fb4934;">-&gt;&gt;</span> <span style="color: #b8bb26;">(</span><span style="color: #d3869b;">:body</span> <span style="color: #83a598;">(</span><span style="color: #fabd2f;">client</span>/get <span style="color: #b8bb26;">"https://api.clashroyale.com/v1/clans/%23JGLJR8L/members"</span> <span style="color: #fe8019;">{</span><span style="color: #d3869b;">:headers</span> <span style="color: #cc241d;">{</span><span style="color: #d3869b;">:Authorization</span> <span style="color: #b8bb26;">(</span>str <span style="color: #b8bb26;">"Bearer "</span> <span style="color: #83a598;">(</span>slurp <span style="color: #b8bb26;">"token"</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span><span style="color: #cc241d;">}</span><span style="color: #fe8019;">}</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>
         <span style="color: #b8bb26;">(</span>#<span style="color: #83a598;">(</span>decode <span style="color: #83a598;">%</span> <span style="color: #d3869b;">true</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>
         <span style="color: #b8bb26;">(</span><span style="color: #d3869b;">:items</span><span style="color: #b8bb26;">)</span>
         <span style="color: #b8bb26;">(</span>map #<span style="color: #83a598;">(</span>map <span style="color: #83a598;">%</span> <span style="color: #fe8019;">[</span><span style="color: #d3869b;">:name</span> <span style="color: #d3869b;">:role</span> <span style="color: #d3869b;">:donations</span><span style="color: #fe8019;">]</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>
    <span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>

<p>
Let&rsquo;s walk through this code snippet.<br />
</p>
<ul class="org-ul">
<li><code>(def don (...))</code> binds whatever we do next to the variable don, which we will continue to use later<br /></li>
<li><code>(-&gt;&gt; (x) (y) (z))</code> is called threadlast. It acts like a pipe, providing the output of (x) as the input of (y) and so forth.<br />
This can be seen as a more elegant shorthand to avoid ugly )))))))s<br />
<code>(-&gt;&gt; (x) (y) (z)</code> is equivalent to <code>(z (y (x)))</code><br /></li>
<li><code>(:body (client/get "https://api.clashroyale.com/v1/clans/%23JGLJR8L/members") ...)</code> is executing a get request on the members api endpoint and extracting the body of that request.<br />
Note we&rsquo;re not checking for the status. Good design would dictate checking it, but that can be done way later.<br /></li>
<li><code>(... {:headers {:Authorization (str "Bearer" (slurp "token"))}}))</code> Is setting up authorizaiton for the api. This is very specific per api, so check the api docs.<br />
Note <code>(slurp "token")</code>. This is a useful pattern for dealing with secrets on server side code. Just put the token into a file and read it at runtime. <code>slurp</code> reads the file <code>token</code>, which resides at the top level of our project directory<br /></li>
<li><code>(#(decode % true))</code> applies a lambda function to the input. we need to use a lambda function because the input should not be appended to the argument list but needs to squeeze between the &ldquo;decode&rdquo; and &ldquo;true&rdquo;.<br />
This is cheshire! And it&rsquo;s probably the only thing we&rsquo;re gonna use of it.<br /></li>
<li><code>(:items)</code> as you might guess, this returns the <code>(:items)</code> list from the now decoded json. These are our clan members.<br /></li>
<li><code>(map #(map % [:name :role :donations]))</code> This line of code took me embarassingly long to write. It makes sure to strip each members of his uninteresting properties, leaving only &ldquo;name&rdquo;, &ldquo;role&rdquo; and &ldquo;donations&rdquo;.<br />
This is why we have a double map. we map for each of the members.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org2da9d9b" class="outline-3">
<h3 id="org2da9d9b"><span class="section-number-3">4.2.</span> Grabbing riverrace (aka war) stats</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">war</span>
   <span style="color: #cc241d;">(</span><span style="color: #fb4934;">-&gt;&gt;</span> <span style="color: #b8bb26;">(</span><span style="color: #d3869b;">:body</span> <span style="color: #83a598;">(</span><span style="color: #fabd2f;">client</span>/get <span style="color: #b8bb26;">"https://api.clashroyale.com/v1/clans/%23JGLJR8L/currentriverrace"</span> <span style="color: #fe8019;">{</span><span style="color: #d3869b;">:headers</span> <span style="color: #cc241d;">{</span><span style="color: #d3869b;">:Authorization</span> <span style="color: #b8bb26;">(</span>str <span style="color: #b8bb26;">"Bearer "</span> <span style="color: #83a598;">(</span>slurp <span style="color: #b8bb26;">"token"</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span><span style="color: #cc241d;">}</span><span style="color: #fe8019;">}</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>
        <span style="color: #b8bb26;">(</span>#<span style="color: #83a598;">(</span>decode <span style="color: #83a598;">%</span> <span style="color: #d3869b;">true</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>
        <span style="color: #b8bb26;">(</span><span style="color: #d3869b;">:clan</span><span style="color: #b8bb26;">)</span>
        <span style="color: #b8bb26;">(</span><span style="color: #d3869b;">:participants</span><span style="color: #b8bb26;">)</span>
        <span style="color: #b8bb26;">(</span>map #<span style="color: #83a598;">(</span>map <span style="color: #83a598;">%</span> <span style="color: #fe8019;">[</span><span style="color: #d3869b;">:name</span> <span style="color: #d3869b;">:decksUsed</span><span style="color: #fe8019;">]</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>
   <span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>

<p>
Knowing what you know from the last section you should be able to figure out what this does on your own.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgf98c5f7" class="outline-2">
<h2 id="orgf98c5f7"><span class="section-number-2">5.</span> Merging the data</h2>
<div class="outline-text-2" id="text-5">
<p>
Great! We can now conveniently check war statistics and donation statistics.<br />
But we want more! We want to check both at the same time. Time to get them into a more useful data structure.<br />
</p>
</div>
