kicklistbot2/data-processing-with-clojure.org
** Getting our keys back

#+begin_src clojure
(def dondic (sort-by :name (map #(hash-map :name (first %) :role (second %) :donations (last %)) don)))
#+end_src

Why don't we use a threadlast here?
Well, because then it would be 3 lines: def, sort-by and mapping to hash-map.
If we did one or two more things to it we would use threadlast, but in this case as oneliner is more ergonomic.

When we reduced the dataset to just the relevant fields earlier, we lost the fields and now we can't elegantly index our data. To fix this we use ~(map #(hash-map :name (first %) :role (second %) :donations (last %)) don)~

Then we sort by the name, just so output is less confusing when we check the repl later, and bind to dondic

The war data suffers from the same problem and is fixed very similarly:

#+begin_src clojure
(def wardic (sort-by :name (map #(hash-map :name (first %) :decks (second %)) war)))
#+end_src

** Merging

Since the two hashmaps are sorted by name you may be tempted to just merge dondic and wardic.
With this api, especially due to new clan members, it sometimes happens that someone appears in the members endpoint but not yet in the riverrace endpoint. So instead we use an alternative workaround:

#+begin_src clojure
(def finally (group-by :name (concat dondic wardic)))
#+end_src

But we're not done. Now our data looks a bit weird.

#+begin_src clojure
{"jj" [{:role elder, :name "jj", :donations 20} {:decks 0, :name "jj"}], ...}
#+end_src

** Making the data prettier

Sidenote: when working with such large sequences of data it can, especially when programming with a lisp, be very beneficial to first extract a sample entry to construct a working lambda function.
So here I extracted my specimen and after a few different ideas I got one that worked for the normal case and didn't freak out about the non-standard cases.

#+begin_src clojure
(def specimen (second finally))
(def speciale(#(merge (first (second %)) (second (second %))) specimen))
#+end_src

Specimen after his fabolous operation: ~{:role member, :decks 0, :name Twerk Lala, :donations 0}~

** Catching the edge case

Now the keen eye may have noticed that I picked the second entry as my specimen.
Choosing the first just gives me this: ~{:role member, :name Beluga, :donations 76}~

Let's fix this guy up

#+begin_src clojure
(merge-with #(max %1 %2) speciale {:donations 0, :decks 0})
#+end_src

Note that we can't simply merge because that may overwrite the fabolous record of more upstanding citizens!
Instead we want to only set the respective keywords to zero if not already present, which this line achieves.

** Tadaa

Now let's bring it all together

#+begin_src clojure
(def forge (map #(merge-with (fn [ra osiris] (max ra osiris)) % {:donations 0, :decks 0}) (map #(merge (first (second %)) (second (second %))) finally)))
#+end_src

