kicklistbot2/data-processing-with-clojure.html

<div id="outline-container-orgf2630be" class="outline-3">
<h3 id="orgf2630be"><span class="section-number-3">5.1.</span> Getting our keys back</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">dondic</span> <span style="color: #cc241d;">(</span>sort-by <span style="color: #d3869b;">:name</span> <span style="color: #b8bb26;">(</span>map #<span style="color: #83a598;">(</span>hash-map <span style="color: #d3869b;">:name</span> <span style="color: #fe8019;">(</span>first <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span> <span style="color: #d3869b;">:role</span> <span style="color: #fe8019;">(</span>second <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span> <span style="color: #d3869b;">:donations</span> <span style="color: #fe8019;">(</span>last <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> don<span style="color: #b8bb26;">)</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>

<p>
Why don&rsquo;t we use a threadlast here?<br />
Well, because then it would be 3 lines: def, sort-by and mapping to hash-map.<br />
If we did one or two more things to it we would use threadlast, but in this case as oneliner is more ergonomic.<br />
</p>

<p>
When we reduced the dataset to just the relevant fields earlier, we lost the fields and now we can&rsquo;t elegantly index our data. To fix this we use <code>(map #(hash-map :name (first %) :role (second %) :donations (last %)) don)</code><br />
</p>

<p>
Then we sort by the name, just so output is less confusing when we check the repl later, and bind to dondic<br />
</p>

<p>
The war data suffers from the same problem and is fixed very similarly:<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">wardic</span> <span style="color: #cc241d;">(</span>sort-by <span style="color: #d3869b;">:name</span> <span style="color: #b8bb26;">(</span>map #<span style="color: #83a598;">(</span>hash-map <span style="color: #d3869b;">:name</span> <span style="color: #fe8019;">(</span>first <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span> <span style="color: #d3869b;">:decks</span> <span style="color: #fe8019;">(</span>second <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> war<span style="color: #b8bb26;">)</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3cb811" class="outline-3">
<h3 id="orgc3cb811"><span class="section-number-3">5.2.</span> Merging</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Since the two hashmaps are sorted by name you may be tempted to just merge dondic and wardic.<br />
With this api, especially due to new clan members, it sometimes happens that someone appears in the members endpoint but not yet in the riverrace endpoint. So instead we use an alternative workaround:<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">finally</span> <span style="color: #cc241d;">(</span>group-by <span style="color: #d3869b;">:name</span> <span style="color: #b8bb26;">(</span>concat dondic wardic<span style="color: #b8bb26;">)</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>

<p>
But we&rsquo;re not done. Now our data looks a bit weird.<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #fe8019;">{</span><span style="color: #b8bb26;">"jj"</span> <span style="color: #cc241d;">[</span><span style="color: #b8bb26;">{</span><span style="color: #d3869b;">:role</span> elder, <span style="color: #d3869b;">:name</span> <span style="color: #b8bb26;">"jj"</span>, <span style="color: #d3869b;">:donations</span> <span style="color: #d3869b; font-weight: bold;">20</span><span style="color: #b8bb26;">}</span> <span style="color: #b8bb26;">{</span><span style="color: #d3869b;">:decks</span> <span style="color: #d3869b; font-weight: bold;">0</span>, <span style="color: #d3869b;">:name</span> <span style="color: #b8bb26;">"jj"</span><span style="color: #b8bb26;">}</span><span style="color: #cc241d;">]</span>, ...<span style="color: #fe8019;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1be1185" class="outline-3">
<h3 id="org1be1185"><span class="section-number-3">5.3.</span> Making the data prettier</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Sidenote: when working with such large sequences of data it can, especially when programming with a lisp, be very beneficial to first extract a sample entry to construct a working lambda function.<br />
So here I extracted my specimen and after a few different ideas I got one that worked for the normal case and didn&rsquo;t freak out about the non-standard cases.<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">specimen</span> <span style="color: #cc241d;">(</span>second finally<span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">speciale</span><span style="color: #cc241d;">(</span>#<span style="color: #b8bb26;">(</span>merge <span style="color: #83a598;">(</span>first <span style="color: #fe8019;">(</span>second <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> <span style="color: #83a598;">(</span>second <span style="color: #fe8019;">(</span>second <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span> specimen<span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>

<p>
Specimen after his fabolous operation: <code>{:role member, :decks 0, :name Twerk Lala, :donations 0}</code><br />
</p>
</div>
</div>

<div id="outline-container-org254dbbf" class="outline-3">
<h3 id="org254dbbf"><span class="section-number-3">5.4.</span> Catching the edge case</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Now the keen eye may have noticed that I picked the second entry as my specimen.<br />
Choosing the first just gives me this: <code>{:role member, :name Beluga, :donations 76}</code><br />
</p>

<p>
Let&rsquo;s fix this guy up<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #fe8019;">(</span>merge-with #<span style="color: #cc241d;">(</span>max <span style="color: #83a598;">%1</span> <span style="color: #83a598;">%2</span><span style="color: #cc241d;">)</span> speciale <span style="color: #cc241d;">{</span><span style="color: #d3869b;">:donations</span> <span style="color: #d3869b; font-weight: bold;">0</span>, <span style="color: #d3869b;">:decks</span> <span style="color: #d3869b; font-weight: bold;">0</span><span style="color: #cc241d;">}</span><span style="color: #fe8019;">)</span>
</pre>
</div>

<p>
Note that we can&rsquo;t simply merge because that may overwrite the fabolous record of more upstanding citizens!<br />
Instead we want to only set the respective keywords to zero if not already present, which this line achieves.<br />
</p>
</div>
</div>

<div id="outline-container-org810d966" class="outline-3">
<h3 id="org810d966"><span class="section-number-3">5.5.</span> Tadaa</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Now let&rsquo;s bring it all together<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">forge</span> <span style="color: #cc241d;">(</span>map #<span style="color: #b8bb26;">(</span>merge-with <span style="color: #83a598;">(</span><span style="color: #fb4934;">fn</span> <span style="color: #fe8019;">[</span>ra osiris<span style="color: #fe8019;">]</span> <span style="color: #fe8019;">(</span>max ra osiris<span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> <span style="color: #83a598;">%</span> <span style="color: #83a598;">{</span><span style="color: #d3869b;">:donations</span> <span style="color: #d3869b; font-weight: bold;">0</span>, <span style="color: #d3869b;">:decks</span> <span style="color: #d3869b; font-weight: bold;">0</span><span style="color: #83a598;">}</span><span style="color: #b8bb26;">)</span> <span style="color: #b8bb26;">(</span>map #<span style="color: #83a598;">(</span>merge <span style="color: #fe8019;">(</span>first <span style="color: #cc241d;">(</span>second <span style="color: #83a598;">%</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span> <span style="color: #fe8019;">(</span>second <span style="color: #cc241d;">(</span>second <span style="color: #83a598;">%</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> finally<span style="color: #b8bb26;">)</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
</div>
