kicklistbot2/data-processing-with-clojure.org
* Wrapping up

Now we can have rather convenient kicklist generation:
Consider we want to kick all members with less than 100 donations and less than 4 decks used.

#+begin_src clojure
(println (map :name (filter #(and (= "member" (:role %)) (> 100 (:donations %)) (> 8 (:decks %))) forge)))
#+end_src

Alternatively we may want to promote anyone who has used at least 8 decks and has 300 donations.

#+begin_src clojure
(println (map :name (filter #(and (= "member" (:role %)) (< 300 (:donations %)) (<= 8  (:decks %))) forge)))
#+end_src

I hope this gave you a nice overview over clojure data processing or at least sparked your motivation to go crunch your own numbers

