kicklistbot2/data-processing-with-clojure.html

<div id="outline-container-org807ec65" class="outline-2">
<h2 id="org807ec65"><span class="section-number-2">6.</span> Wrapping up</h2>
<div class="outline-text-2" id="text-6">
<p>
Now we can have rather convenient kicklist generation:<br />
Consider we want to kick all members with less than 100 donations and less than 4 decks used.<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #fe8019;">(</span>println <span style="color: #cc241d;">(</span>map <span style="color: #d3869b;">:name</span> <span style="color: #b8bb26;">(</span>filter #<span style="color: #83a598;">(</span><span style="color: #fb4934;">and</span> <span style="color: #fe8019;">(</span>= <span style="color: #b8bb26;">"member"</span> <span style="color: #cc241d;">(</span><span style="color: #d3869b;">:role</span> <span style="color: #83a598;">%</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span> <span style="color: #fe8019;">(</span>&gt; <span style="color: #d3869b; font-weight: bold;">100</span> <span style="color: #cc241d;">(</span><span style="color: #d3869b;">:donations</span> <span style="color: #83a598;">%</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span> <span style="color: #fe8019;">(</span>&gt; <span style="color: #d3869b; font-weight: bold;">8</span> <span style="color: #cc241d;">(</span><span style="color: #d3869b;">:decks</span> <span style="color: #83a598;">%</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> forge<span style="color: #b8bb26;">)</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>

<p>
Alternatively we may want to promote anyone who has used at least 8 decks and has 300 donations.<br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #fe8019;">(</span>println <span style="color: #cc241d;">(</span>map <span style="color: #d3869b;">:name</span> <span style="color: #b8bb26;">(</span>filter #<span style="color: #83a598;">(</span><span style="color: #fb4934;">and</span> <span style="color: #fe8019;">(</span>= <span style="color: #b8bb26;">"member"</span> <span style="color: #cc241d;">(</span><span style="color: #d3869b;">:role</span> <span style="color: #83a598;">%</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span> <span style="color: #fe8019;">(</span>&lt; <span style="color: #d3869b; font-weight: bold;">300</span> <span style="color: #cc241d;">(</span><span style="color: #d3869b;">:donations</span> <span style="color: #83a598;">%</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span> <span style="color: #fe8019;">(</span>&lt;= <span style="color: #d3869b; font-weight: bold;">8</span>  <span style="color: #cc241d;">(</span><span style="color: #d3869b;">:decks</span> <span style="color: #83a598;">%</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> forge<span style="color: #b8bb26;">)</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>

<p>
I hope this gave you a nice overview over clojure data processing or at least sparked your motivation to go crunch your own numbers<br />
</p>
</div>
</div>
