kicklistbot2/data-processing-with-clojure.html

<div id="outline-container-org4750c80" class="outline-2">
<h2 id="org4750c80"><span class="section-number-2">7.</span> Full code</h2>
<div class="outline-text-2" id="text-7">
<p>
<i>Note how I omitted the println from the last two lines so you can run the code block in org-mode</i><br />
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #fe8019;">(</span><span style="color: #fb4934;">ns</span> <span style="color: #fabd2f;">kicklistbot2.core</span>
  <span style="color: #cc241d;">(</span><span style="color: #d3869b;">:require</span> <span style="color: #b8bb26;">[</span>cheshire.core <span style="color: #d3869b;">:refer</span> <span style="color: #d3869b;">:all</span><span style="color: #b8bb26;">]</span><span style="color: #cc241d;">)</span>
  <span style="color: #cc241d;">(</span><span style="color: #d3869b;">:require</span> <span style="color: #b8bb26;">[</span>clj-http.client <span style="color: #d3869b;">:as</span> client<span style="color: #b8bb26;">]</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>

<span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">don</span>
    <span style="color: #cc241d;">(</span><span style="color: #fb4934;">-&gt;&gt;</span> <span style="color: #b8bb26;">(</span><span style="color: #d3869b;">:body</span> <span style="color: #83a598;">(</span><span style="color: #fabd2f;">client</span>/get <span style="color: #b8bb26;">"https://api.clashroyale.com/v1/clans/%23JGLJR8L/members"</span> <span style="color: #fe8019;">{</span><span style="color: #d3869b;">:headers</span> <span style="color: #cc241d;">{</span><span style="color: #d3869b;">:Authorization</span> <span style="color: #b8bb26;">(</span>str <span style="color: #b8bb26;">"Bearer "</span> <span style="color: #83a598;">(</span>slurp <span style="color: #b8bb26;">"token"</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span><span style="color: #cc241d;">}</span><span style="color: #fe8019;">}</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>
         <span style="color: #b8bb26;">(</span>#<span style="color: #83a598;">(</span>decode <span style="color: #83a598;">%</span> <span style="color: #d3869b;">true</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>
         <span style="color: #b8bb26;">(</span><span style="color: #d3869b;">:items</span><span style="color: #b8bb26;">)</span>
         <span style="color: #b8bb26;">(</span>map #<span style="color: #83a598;">(</span>map <span style="color: #83a598;">%</span> <span style="color: #fe8019;">[</span><span style="color: #d3869b;">:name</span> <span style="color: #d3869b;">:role</span> <span style="color: #d3869b;">:donations</span><span style="color: #fe8019;">]</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>
    <span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>

  <span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">war</span>
   <span style="color: #cc241d;">(</span><span style="color: #fb4934;">-&gt;&gt;</span> <span style="color: #b8bb26;">(</span><span style="color: #d3869b;">:body</span> <span style="color: #83a598;">(</span><span style="color: #fabd2f;">client</span>/get <span style="color: #b8bb26;">"https://api.clashroyale.com/v1/clans/%23JGLJR8L/currentriverrace"</span> <span style="color: #fe8019;">{</span><span style="color: #d3869b;">:headers</span> <span style="color: #cc241d;">{</span><span style="color: #d3869b;">:Authorization</span> <span style="color: #b8bb26;">(</span>str <span style="color: #b8bb26;">"Bearer "</span> <span style="color: #83a598;">(</span>slurp <span style="color: #b8bb26;">"token"</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span><span style="color: #cc241d;">}</span><span style="color: #fe8019;">}</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>
        <span style="color: #b8bb26;">(</span>#<span style="color: #83a598;">(</span>decode <span style="color: #83a598;">%</span> <span style="color: #d3869b;">true</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>
        <span style="color: #b8bb26;">(</span><span style="color: #d3869b;">:clan</span><span style="color: #b8bb26;">)</span>
        <span style="color: #b8bb26;">(</span><span style="color: #d3869b;">:participants</span><span style="color: #b8bb26;">)</span>
        <span style="color: #b8bb26;">(</span>map #<span style="color: #83a598;">(</span>map <span style="color: #83a598;">%</span> <span style="color: #fe8019;">[</span><span style="color: #d3869b;">:name</span> <span style="color: #d3869b;">:decksUsed</span><span style="color: #fe8019;">]</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>
   <span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>

<span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">dondic</span> <span style="color: #cc241d;">(</span>sort-by <span style="color: #d3869b;">:name</span> <span style="color: #b8bb26;">(</span>map #<span style="color: #83a598;">(</span>hash-map <span style="color: #d3869b;">:name</span> <span style="color: #fe8019;">(</span>first <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span> <span style="color: #d3869b;">:role</span> <span style="color: #fe8019;">(</span>second <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span> <span style="color: #d3869b;">:donations</span> <span style="color: #fe8019;">(</span>last <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> don<span style="color: #b8bb26;">)</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">wardic</span> <span style="color: #cc241d;">(</span>sort-by <span style="color: #d3869b;">:name</span> <span style="color: #b8bb26;">(</span>map #<span style="color: #83a598;">(</span>hash-map <span style="color: #d3869b;">:name</span> <span style="color: #fe8019;">(</span>first <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span> <span style="color: #d3869b;">:decks</span> <span style="color: #fe8019;">(</span>second <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> war<span style="color: #b8bb26;">)</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">finally</span> <span style="color: #cc241d;">(</span>group-by <span style="color: #d3869b;">:name</span> <span style="color: #b8bb26;">(</span>concat dondic wardic<span style="color: #b8bb26;">)</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">(</span><span style="color: #fb4934;">def</span> <span style="color: #83a598;">forge</span> <span style="color: #cc241d;">(</span>map #<span style="color: #b8bb26;">(</span>merge-with <span style="color: #83a598;">(</span><span style="color: #fb4934;">fn</span> <span style="color: #fe8019;">[</span>ra osiris<span style="color: #fe8019;">]</span> <span style="color: #fe8019;">(</span>max ra osiris<span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> <span style="color: #83a598;">%</span> <span style="color: #83a598;">{</span><span style="color: #d3869b;">:donations</span> <span style="color: #d3869b; font-weight: bold;">0</span>, <span style="color: #d3869b;">:decks</span> <span style="color: #d3869b; font-weight: bold;">0</span><span style="color: #83a598;">}</span><span style="color: #b8bb26;">)</span> <span style="color: #b8bb26;">(</span>map #<span style="color: #83a598;">(</span>merge <span style="color: #fe8019;">(</span>first <span style="color: #cc241d;">(</span>second <span style="color: #83a598;">%</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span> <span style="color: #fe8019;">(</span>second <span style="color: #cc241d;">(</span>second <span style="color: #83a598;">%</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> finally<span style="color: #b8bb26;">)</span><span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>

<span style="color: #fe8019;">(</span>map <span style="color: #d3869b;">:name</span> <span style="color: #cc241d;">(</span>filter #<span style="color: #b8bb26;">(</span><span style="color: #fb4934;">and</span> <span style="color: #83a598;">(</span>= <span style="color: #b8bb26;">"member"</span> <span style="color: #fe8019;">(</span><span style="color: #d3869b;">:role</span> <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> <span style="color: #83a598;">(</span>&gt; <span style="color: #d3869b; font-weight: bold;">100</span> <span style="color: #fe8019;">(</span><span style="color: #d3869b;">:donations</span> <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> <span style="color: #83a598;">(</span>&gt; <span style="color: #d3869b; font-weight: bold;">8</span> <span style="color: #fe8019;">(</span><span style="color: #d3869b;">:decks</span> <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span> forge<span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">(</span>map <span style="color: #d3869b;">:name</span> <span style="color: #cc241d;">(</span>filter #<span style="color: #b8bb26;">(</span><span style="color: #fb4934;">and</span> <span style="color: #83a598;">(</span>= <span style="color: #b8bb26;">"member"</span> <span style="color: #fe8019;">(</span><span style="color: #d3869b;">:role</span> <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> <span style="color: #83a598;">(</span>&lt; <span style="color: #d3869b; font-weight: bold;">300</span> <span style="color: #fe8019;">(</span><span style="color: #d3869b;">:donations</span> <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span> <span style="color: #83a598;">(</span>&lt;= <span style="color: #d3869b; font-weight: bold;">8</span>  <span style="color: #fe8019;">(</span><span style="color: #d3869b;">:decks</span> <span style="color: #83a598;">%</span><span style="color: #fe8019;">)</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span> forge<span style="color: #cc241d;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: port19</p>
<p class="date">Created: 2022-09-17 Sat 18:50</p>
</div>
</body>
</html>
